Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals
The ModelingUnitsDecimals class represents the modeling units and decimals defined in options.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.LengthUnit
The length modeling unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.AngleUnit
The modeling angle unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnit
The spring constant modeling unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnit
The rot. spring constant modeling unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.ForceUnit
The force modeling unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedLoadUnit
The distributed load modeling unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SurfaceLoadUnit
The surface load modeling unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.MomentUnit
The moment modeling unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedMomentUnit
The distributed moment modeling unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.TemperatureUnit
The temperature modeling unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DeformationUnit
The deformation modeling unit type.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.LengthUnitDecimals
The length modeling unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.FactorUnitDecimals
The factor modeling unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.AngleUnitDecimals
The modeling angle unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantUnitDecimals
The spring constant modeling unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotationSpringConstantUnitDecimals
The rot. spring constant modeling unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.ForceUnitDecimals
The force modeling unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedLoadUnitDecimals
The distributed load modeling unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SurfaceLoadUnitDecimals
The surface load modeling unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.MomentUnitDecimals
The moment modeling unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedMomentUnitDecimals
The distributed moment modeling unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.TemperatureUnitDecimals
The temperature modeling unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DeformationUnitDecimals
The deformation modeling unit decimals (1-6).

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.LengthDecimalsName
The option name for length decimal count.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.AngleDecimalsName
The option name  for angle decimal count.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SpringConstantDecimalsName
The option name for spring decimal count.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.RotSpringConstantDecimalsName
The option name for rot spring decimal count.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.FactorDecimalsName
The option name for factor decimal count.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.ForceDecimalsName
The option name for force decimal count.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedLoadDecimalsName
The option name for distributed decimal count.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.SurfaceLoadDecimalsName
The option name for surface load decimal count.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.MomentDecimalsName
The option name for moment decimal count.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DistributedMomentDecimalsName
The option name for distributed moment decimal count.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.TemperatureDecimalsName
The option name for temperature decimal count.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals.DeformationDecimalsName
The option name for deformation decimal count.